app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
    @songs = Artist.find(params[:artist_id]).songs
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 0]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]